<!-- add-pr-comment:830/cloud/cdktf/website -->

```
cloudflare_r2_bucket.WebsiteBucket: Refreshing state... [id=layertwo-dev-website]
cloudflare_ruleset.WebsiteRuleset: Refreshing state... [id=ea8679e2c20146c6b91dd10cda883e82]
cloudflare_r2_custom_domain.R2CustomDomainObjectResourceWWW: Refreshing state...
cloudflare_r2_custom_domain.R2CustomDomainObjectResource: Refreshing state...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # cloudflare_r2_bucket.WebsiteBucket will be updated in-place
  ~ resource "cloudflare_r2_bucket" "WebsiteBucket" {
      ~ creation_date = "2025-05-11T03:02:49.601Z" -> (known after apply)
        id            = "layertwo-dev-website"
      + jurisdiction  = "default"
      + location      = "wnam"
        name          = "layertwo-dev-website"
      + storage_class = "Standard"
        # (1 unchanged attribute hidden)
    }

  # cloudflare_r2_custom_domain.R2CustomDomainObjectResource will be updated in-place
  ~ resource "cloudflare_r2_custom_domain" "R2CustomDomainObjectResource" {
      ~ enabled      = false -> true
      + jurisdiction = "default"
      ~ status       = {
          ~ ownership = "active" -> (known after apply)
          ~ ssl       = "active" -> (known after apply)
        } -> (known after apply)
      ~ zone_name    = "layertwo.dev" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # cloudflare_r2_custom_domain.R2CustomDomainObjectResourceWWW will be updated in-place
  ~ resource "cloudflare_r2_custom_domain" "R2CustomDomainObjectResourceWWW" {
      + jurisdiction = "default"
      ~ status       = {
          ~ ownership = "active" -> (known after apply)
          ~ ssl       = "active" -> (known after apply)
        } -> (known after apply)
      ~ zone_name    = "layertwo.dev" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_ruleset.WebsiteRuleset will be updated in-place
  ~ resource "cloudflare_ruleset" "WebsiteRuleset" {
        id      = "ea8679e2c20146c6b91dd10cda883e82"
        name    = "redirect-to-index"
      ~ rules   = [
          ~ {
              + description       = ""
              ~ id                = "d9bceb1c495d40e78ed9d7ac56b47262" -> (known after apply)
                # (5 unchanged attributes hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    tofu apply "plan"

```